## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:59" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:59" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:8cc5dc1f55c8938af6900352e14317d66a0b7b01be84e407759b783c590f8f9d" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:39dc9de0b9f32799dda5a11bcb0022fb40be5421b39976ed9bf4b05f6980909f"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 59 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-cpfValidation must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-cpfValidation" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "c3faa07aa23dbaf9d25281622152bc55-5" -> "cfd18db7028e9d1e1304ab4f4ffbfcff"
      ~ id                     = "cpfValidation.1e4683cb85e97d3200d97928196ea632.zip" -> (known after apply)
      ~ key                    = "cpfValidation.1e4683cb85e97d3200d97928196ea632.zip" -> "cpfValidation.cfd18db7028e9d1e1304ab4f4ffbfcff.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "1e4683cb85e97d3200d97928196ea632" -> "cfd18db7028e9d1e1304ab4f4ffbfcff"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "ZUseV7SFLq5vOzcBH3OVEgaYHn4mVyc1" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-excelToJson must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-excelToJson" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "46bd4905044bdd17d1d04ca5c42f955f-6" -> "0eaf165ba62ffc297722ca4895ab194a"
      ~ id                     = "excelToJson.db2decf258f703af202a664d565cbcd6.zip" -> (known after apply)
      ~ key                    = "excelToJson.db2decf258f703af202a664d565cbcd6.zip" -> "excelToJson.0eaf165ba62ffc297722ca4895ab194a.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "db2decf258f703af202a664d565cbcd6" -> "0eaf165ba62ffc297722ca4895ab194a"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "eASLrwjHyov.k.yXqY5EJEW_SZmEicGw" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-graphql must be replaced
+/- resource "aws_s3_object" "lambda_artifact-graphql" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "0f79c21f9eb94539042c7ac6b4f46415-6" -> "e4448d8a0e2fcc75d4d423b693b40ef5"
      ~ id                     = "graphql.ab8ab0d973c39faaa38946663c86d25d.zip" -> (known after apply)
      ~ key                    = "graphql.ab8ab0d973c39faaa38946663c86d25d.zip" -> "graphql.e4448d8a0e2fcc75d4d423b693b40ef5.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "ab8ab0d973c39faaa38946663c86d25d" -> "e4448d8a0e2fcc75d4d423b693b40ef5"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "Z7rDqXyRoQm7bKD4Axm4RoFUj875pRLc" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "a9a2325926a7d309241059e13ef44af5" -> "733da1921fe51ab82103b18aff9038b0"
        id                     = "dist/200.html"
      ~ source_hash            = "a9a2325926a7d309241059e13ef44af5" -> "733da1921fe51ab82103b18aff9038b0"
        tags                   = {}
      ~ version_id             = "pp1s3b1__dOo537oSYsLbqn_JiJab.Wc" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "21c7a5713eec98d43125caf0c31db977" -> "cf4af724c8e15b2092ae30f2d7b6a00d"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "21c7a5713eec98d43125caf0c31db977" -> "cf4af724c8e15b2092ae30f2d7b6a00d"
        tags                   = {}
      ~ version_id             = "j_uEw8Npwcb68Nm5kgMOC9_0OupDBdTd" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "2385c20fda17aff138e5df5b803f9b91" -> "aa007009da9d5dbd8af13dc6280686da"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "2385c20fda17aff138e5df5b803f9b91" -> "aa007009da9d5dbd8af13dc6280686da"
        tags                   = {}
      ~ version_id             = "X_RQj3KmTbXry0EK5aOd6RE.1mce2CcS" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "a9a2325926a7d309241059e13ef44af5" -> "733da1921fe51ab82103b18aff9038b0"
        id                     = "dist/index.html"
      ~ source_hash            = "a9a2325926a7d309241059e13ef44af5" -> "733da1921fe51ab82103b18aff9038b0"
        tags                   = {}
      ~ version_id             = "PedlrxymkGd0chrCis3OhHaMb2XpyO3t" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadsPage.bb0182a1.chunk.js"] will be destroyed
  # (because key ["static/js/UploadUploadsPage.bb0182a1.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "a6a5f7d785ca9e3cdf219486287d1a62" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadUploadsPage.bb0182a1.chunk.js" -> null
-       key                    = "dist/static/js/UploadUploadsPage.bb0182a1.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadsPage.bb0182a1.chunk.js" -> null
-       source_hash            = "a6a5f7d785ca9e3cdf219486287d1a62" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "pxd3fF7QCpUfHwMU53fD3Peb3zDo5kg1" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadsPage.bb0182a1.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/UploadUploadsPage.bb0182a1.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "43ff778014632a7ef9766fd4374290b4" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadUploadsPage.bb0182a1.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/UploadUploadsPage.bb0182a1.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadsPage.bb0182a1.chunk.js.LICENSE.txt" -> null
-       source_hash            = "43ff778014632a7ef9766fd4374290b4" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "Pnb6lyxCpQ.CbRubrE6swjzdsgb08A9E" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadsPage.c105414b.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "1e655b06164ce9d7f43f68e29db344d7"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadUploadsPage.c105414b.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadsPage.c105414b.chunk.js"
+       source_hash            = "1e655b06164ce9d7f43f68e29db344d7"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadsPage.c105414b.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "43ff778014632a7ef9766fd4374290b4"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadUploadsPage.c105414b.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadsPage.c105414b.chunk.js.LICENSE.txt"
+       source_hash            = "43ff778014632a7ef9766fd4374290b4"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.38202ff3.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "49b58ecfec104f953c242172d53293bf"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.38202ff3.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.38202ff3.js"
+       source_hash            = "49b58ecfec104f953c242172d53293bf"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.38202ff3.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "b703266ba347d460c07ac79899e011fa"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.38202ff3.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.38202ff3.js.LICENSE.txt"
+       source_hash            = "b703266ba347d460c07ac79899e011fa"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.44fe760f.js"] will be destroyed
  # (because key ["static/js/app.44fe760f.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "c2e98495564e83b5f027f0175063d510" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.44fe760f.js" -> null
-       key                    = "dist/static/js/app.44fe760f.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.44fe760f.js" -> null
-       source_hash            = "c2e98495564e83b5f027f0175063d510" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "u4WUFf7rQQKdyBgKWkmIuZT23hnm_DDx" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.44fe760f.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.44fe760f.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "b703266ba347d460c07ac79899e011fa" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.44fe760f.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.44fe760f.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.44fe760f.js.LICENSE.txt" -> null
-       source_hash            = "b703266ba347d460c07ac79899e011fa" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "8muQX1nt5b4azupR6plcB3eC1lyvYWJo" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.7bb81fc6.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "3c818a3563d4242cc92aab15c57fba32"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/runtime-app.7bb81fc6.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.7bb81fc6.js"
+       source_hash            = "3c818a3563d4242cc92aab15c57fba32"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.e4e1bc01.js"] will be destroyed
  # (because key ["static/js/runtime-app.e4e1bc01.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "3da77b5968ae28dbb72b25b692b699c0" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/runtime-app.e4e1bc01.js" -> null
-       key                    = "dist/static/js/runtime-app.e4e1bc01.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.e4e1bc01.js" -> null
-       source_hash            = "3da77b5968ae28dbb72b25b692b699c0" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "7Hx4eQGRHyznxYKjh7NethpexLU6ta63" -> null
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ last_modified                  = "2024-03-22T22:47:20.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:28" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:28/invocations" -> (known after apply)
      ~ s3_key                         = "cpfValidation.1e4683cb85e97d3200d97928196ea632.zip" -> "cpfValidation.cfd18db7028e9d1e1304ab4f4ffbfcff.zip"
        tags                           = {}
      ~ version                        = "28" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "527a3eb2b71bd008c91f7ebf9585ea07ef4a88fb" -> "c4417a5882f820c877820b04e9c1afe3d7ffc0ca"
              ~ "DD_TAGS"                      = "git.commit.sha:527a3eb2b71bd008c91f7ebf9585ea07ef4a88fb,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:c4417a5882f820c877820b04e9c1afe3d7ffc0ca,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "527a3eb2b71bd008c91f7ebf9585ea07ef4a88fb" -> "c4417a5882f820c877820b04e9c1afe3d7ffc0ca"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "28" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-excelToJson"
      ~ last_modified                  = "2024-03-22T22:47:20.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:28" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:28/invocations" -> (known after apply)
      ~ s3_key                         = "excelToJson.db2decf258f703af202a664d565cbcd6.zip" -> "excelToJson.0eaf165ba62ffc297722ca4895ab194a.zip"
        tags                           = {}
      ~ version                        = "28" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "527a3eb2b71bd008c91f7ebf9585ea07ef4a88fb" -> "c4417a5882f820c877820b04e9c1afe3d7ffc0ca"
              ~ "DD_TAGS"                      = "git.commit.sha:527a3eb2b71bd008c91f7ebf9585ea07ef4a88fb,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:c4417a5882f820c877820b04e9c1afe3d7ffc0ca,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "527a3eb2b71bd008c91f7ebf9585ea07ef4a88fb" -> "c4417a5882f820c877820b04e9c1afe3d7ffc0ca"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "28" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ last_modified                  = "2024-03-22T22:47:35.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:75" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:75/invocations" -> (known after apply)
      ~ s3_key                         = "graphql.ab8ab0d973c39faaa38946663c86d25d.zip" -> "graphql.e4448d8a0e2fcc75d4d423b693b40ef5.zip"
        tags                           = {}
      ~ version                        = "75" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "527a3eb2b71bd008c91f7ebf9585ea07ef4a88fb" -> "c4417a5882f820c877820b04e9c1afe3d7ffc0ca"
              ~ "DD_TAGS"                            = "git.commit.sha:527a3eb2b71bd008c91f7ebf9585ea07ef4a88fb,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:c4417a5882f820c877820b04e9c1afe3d7ffc0ca,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "527a3eb2b71bd008c91f7ebf9585ea07ef4a88fb" -> "c4417a5882f820c877820b04e9c1afe3d7ffc0ca"
                # (17 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "75" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 12 to add, 8 to change, 12 to destroy.
```

</details>

*Pusher: @Vikariusu, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/8440616712)*